



nc: 80
kpt_shape: [1, 3]
scales:

  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]








backbone:

  - [-1, 1, RevCol, ['C2f', [64, 128, 256, 512], [3, 6, 6, 3], 2]]
  - [-1, 1, SPPF, [1024, 5]]


head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3,  RepNCSPELAN4, [360, 360, 180, 1]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, RepNCSPELAN4, [240, 240, 120, 1]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, RepNCSPELAN4, [240, 240, 120, 1]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 3,  C2fCIB, [1024, True, True]]

  - [[11, 14, 17], 1, Pose, [nc, kpt_shape]]
